app/views/shots/index.html.erb

                <span class="icon"><i class="fa fa-comment"></i></span>
                 <%= shot.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = ?  [["shot_id", 10]]