app/views/shots/show.html.erb

					<section class="comments">
						<h2 class="subtitle is-5"><%=pluralize(@shot.comments.count, 'Comment')%></h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."shot_id" = ?  [["shot_id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = ?  [["shot_id", 6]]