app/controllers/comments_controller.rb

  def create
    @shot = Shot.find(params[:shot_id])
    @comment = @shot.comments.create(comment_params)
---
SELECT  "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("response", "name", "created_at", "updated_at", "user_id", "shot_id") VALUES (?, ?, ?, ?, ?, ?)  [["response", "this is comment"], ["name", "elaraby elaidy"], ["created_at", "2021-11-04 08:28:18.617638"], ["updated_at", "2021-11-04 08:28:18.617638"], ["user_id", 3], ["shot_id", 6]]