app/controllers/shots_controller.rb

SELECT "shots".* FROM "shots" ORDER BY created_at DESC
---
  def index
    @shots = Shot.all

INSERT INTO "shots" ("title", "description", "user_id", "created_at", "updated_at", "user_shot") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @shot = Shot.new(shot_params)

    respond_to do |format|
      if @shot.save

DELETE FROM "shots" WHERE "shots"."id" = ?  [["id", 7]]
---
  def destroy
    @shot.destroy

SELECT  "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_shot
      @shot = Shot.find(params[:id])